IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
/**-------------------------------------------------------------------------
@file	bt_app_stm32wba.cpp

@brief	STM32WBAxx BLE port - top-level application init, stack bring-up,
        and run loop. Models ST's full BLE host stack (ACI commands), the
        STM32CubeWBA middleware path. Mirrors the vendor-middleware shape of
        the BM and nRF52 ports.

        File responsibilities:
            - BtAppStackInit:  bring up ST BLE stack, register HCI callback,
                               set TX power and BD address.
            - BtAppInit:       populate g_BtAppData, init GAP/GATT, register
                               user services, init DIS, init advertising.
            - BtAppRun:        start adv (if peripheral) + main loop.
            - BtAppEvtWait:    weak default uses WFE. RTOS apps override.
            - BtAppEvtDispatch: drains HCI/ACI events to user handlers.
            - on_conn_params_evt: callback for the connection-update
                                   procedure handled in bt_cp_stm32wba.cpp.
            - BtAppNotify, BtAppDisconnect, BtAppGapDeviceNameSet,
              BtAppWrite, BtAppEnableNotify: standard BLE app helpers
              implemented via ACI commands.

        Adv/scan/dev/cp/dis/isr code lives in bt_*_stm32wba.cpp peers.

@author	Hoang Nguyen Hoan
@date	May 25, 2026

@license

MIT License

Copyright (c) 2026, I-SYST inc., all rights reserved

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is furnished
to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#include <stdio.h>
#include <inttypes.h>
#include <stdlib.h>
#include <string.h>

#include "stm32wbaxx.h"
#include "stm32wbaxx_hal.h"

// STM32CubeWBA BLE middleware. Names are stable across 1.3.x / 1.4.x.
#include "ble_types.h"
#include "ble_std.h"
#include "ble.h"
#include "ble_gap_aci.h"
#include "ble_gatt_aci.h"
#include "ble_hal_aci.h"
#include "ble_events.h"
#include "ble_hci_le.h"
#include "ble_vs_codes.h"
#include "host_stack_if.h"
#include "blestack.h"
#include "ble_bufsize.h"
#include "ll_sys.h"
#include "ll_sys_if.h"
#include "bpka.h"
#include "scm.h"
#include "stm32_seq.h"

#include "istddef.h"
#include "idelay.h"
#include "coredev/iopincfg.h"
#include "iopinctrl.h"
#include "bluetooth/bt_uuid.h"
#include "bluetooth/bt_app.h"
#include "bluetooth/bt_appearance.h"
#include "bluetooth/bt_gatt.h"
#include "bluetooth/bt_gap.h"
#include "bluetooth/bt_smp.h"
#include "bluetooth/bt_dev.h"
#include "bluetooth/bt_att.h"
#include "app_evt_handler.h"
#include "bt_wba_event_router.h"

/******** For DEBUG ************/
//#define UART_DEBUG_ENABLE

#ifdef UART_DEBUG_ENABLE
#include "coredev/uart.h"
extern UART g_Uart;
#define DEBUG_PRINTF(...)		g_Uart.printf(__VA_ARGS__)
#else
#define DEBUG_PRINTF(...)
#endif
/*******************************/

// ST BLE stack expects success = 0; everything else is an error code.
#ifndef BLE_STATUS_SUCCESS
#define BLE_STATUS_SUCCESS				0x00
#endif

// ATT MTU. Default per BT spec is 23. The stack negotiates higher via
// aci_gatt_exchange_config. Apps that set BtAppCfg_t::MaxMtu request a
// higher value; the cap depends on the stack configuration buffer sizes.
#ifndef GATT_MTU_SIZE_DEFAULT
#define GATT_MTU_SIZE_DEFAULT			23
#endif

// Stack-event scheduler task id. STM32CubeWBA convention is to use the
// sequencer (UTIL_SEQ) to fan HCI/ACI events out from the interrupt
// context to the main thread. The id is local to this port.
#define BT_APP_TASK_HCI_USER_EVT		0
#define BT_APP_TASK_BLE_HOST			1

// Connection-parameter update timing knobs - same intent as the BM port.
#define BT_APP_CONN_PARAMS_FIRST_DELAY_MS	5000
#define BT_APP_CONN_PARAMS_NEXT_DELAY_MS	30000
#define BT_APP_CONN_PARAMS_MAX_ATTEMPTS		3

// SMP key-size limits per BT spec.
#define SEC_PARAM_MIN_KEY_SIZE			7
#define SEC_PARAM_MAX_KEY_SIZE			16

// HCI error used when the application cannot complete an authenticated user
// interaction. aci_gap_pass_key_resp has no reject form; submitting zero would
// accept the valid passkey 000000 rather than cancel pairing.
#define BT_APP_HCI_AUTH_FAILURE			0x05

// Mapping from BtGap SecType to ST's IO-capability + auth-requirement
// values is done at init time. Default to NoInputNoOutput / no MITM.
#ifndef BT_APP_DEFAULT_IO_CAPABILITY
#define BT_APP_DEFAULT_IO_CAPABILITY	IO_CAP_NO_INPUT_NO_OUTPUT
#endif

// Forward decls from peer port files (defined in 9b..9e).
extern "C" bool BtAppAdvInit(const BtAppCfg_t *pCfg);
extern "C" bool BtDisInit(const struct __Bt_App_Cfg *pCfg);
void BtAdvWbaConnected(void);

// User hooks - weak symbols overridden by the app.
__attribute__((weak)) void BtAppInitUserServices(void) {}
__attribute__((weak)) void BtAppInitUserData(void) {}

// --- Port-private data ---
//
// Sized smaller than the BM equivalent because ST handles adv handle
// allocation internally - we don't track a separate AdvHdl on this port.
typedef struct __Bt_App_WbaData {
	uint16_t	GattSrvcStartHdl;	//!< First handle of the user GATT service
	uint16_t	PasskeyRejectedHdl;	//!< Synchronous passkey UI rejection marker
	uint8_t		IoCapability;		//!< SMP IO cap - mapped from SecType at init
	uint8_t		AuthRequirement;	//!< SMP auth requirement bits
	bool		bOobEnabled;		//!< LESC OOB explicitly enabled by app config
	bool		bStackInited;		//!< true after BleStack_Init succeeded
	uint16_t	NvmCacheWords;		//!< 64 bit words preloaded into the cache
} BtAppWbaData_t;

static BtAppWbaData_t s_WbaData = {
	.GattSrvcStartHdl = 0,
	.PasskeyRejectedHdl = BT_CONN_HDL_INVALID,
	.IoCapability     = BT_APP_DEFAULT_IO_CAPABILITY,
	.AuthRequirement  = 0,
	.bOobEnabled      = false,
	.bStackInited     = false,
};

// HCI user-event indication. ST's BLE stack calls this from IRQ context
// when an event is queued; we just schedule the user-evt processing task.
extern "C" void hci_notify_asynch_evt(void *pdata)
{
	(void)pdata;
	UTIL_SEQ_SetTask(1U << BT_APP_TASK_HCI_USER_EVT, CFG_SCH_PRIO_0);
	BtAppEvtNotify();
}

// BLE host scheduler hook - the stack calls this when the host needs CPU.
extern "C" void BLE_RESUME_FLOW_PROCESS_Callback(void)
{
	UTIL_SEQ_SetTask(1U << BT_APP_TASK_BLE_HOST, CFG_SCH_PRIO_0);
	BtAppEvtNotify();
}

// Task body: drain queued HCI events to registered callbacks. ST exposes
// hci_user_evt_proc() which walks the event queue and invokes the user
// callback per event.
static void HciUserEvtProcessTask(void)
{
	hci_user_evt_proc();
}

// Task body: let the BLE host stack process its pending work. Drives the
// internal state machines that issue ACI commands and forward events.
static void BleHostTask(void)
{
	BleStack_Process();
}

