IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
// --- GATT client discovery (central role) ---
//
// ST runs each discovery procedure to completion and signals the end with a
// single ACI_GATT_PROC_COMPLETE event; the per-entry data arrives in
// ACI_ATT_READ_BY_GROUP_TYPE_RESP (services), ACI_ATT_READ_BY_TYPE_RESP
// (characteristics) and ACI_ATT_FIND_INFO_RESP (descriptors) events before it.
// The cursor walks services, then characteristics per service, then descriptors
// per characteristic (to locate the CCCD), then calls BtDeviceDiscovered.
// Values for BtDevDiscState_t::Phase on this port. Idle is 0, which is what a
// freshly cleared peer record holds.
enum {
	DISC_IDLE = 0,
	DISC_SERVICES,
	DISC_CHARS,
	DISC_DESCS
};

// Discovery progress lives in the peer record, one cursor per link
// (pDev->Discovery). It used to be four file scope variables, so a second
// central link discovering at the same time overwrote the first one's position.
// The ACI response events all name their link in Connection_Handle, so each
// callback resolves its own peer.

static void BtAppDiscStartChar(BtDevice_t *pDev);
static void BtAppDiscStartDesc(BtDevice_t *pDev);
static void WbaDiscSrvc(const aci_att_read_by_group_type_resp_event_rp0 *p);
static void WbaDiscChar(const aci_att_read_by_type_resp_event_rp0 *p);
static void WbaDiscDesc(const aci_att_find_info_resp_event_rp0 *p);
static void WbaDiscProcComplete(const aci_gatt_proc_complete_event_rp0 *p);

// Server side write from a connected client. ST reports CCCD writes and
// characteristic value writes through ACI_GATT_ATTRIBUTE_MODIFIED. Route a CCCD
// write to BtGattCccdSet (which stores the per connection value and fires the
// notify/indicate subscribe callbacks) and a value write to the char WrCB. This
// mirrors the nRF52 BLE_GATTS_EVT_WRITE handler.
static void WbaGattAttrModified(uint16_t ConnHdl, uint16_t AttrHdl,
								uint16_t Offset, uint8_t *pData, uint16_t Len)
{
	BtGattSrvc_t *pSrvc = BtGattGetSrvcList();

	while (pSrvc != nullptr)
	{
		for (int i = 0; i < pSrvc->NbChar; i++)
		{
			BtGattChar_t *pChar = &pSrvc->pCharArray[i];

			if (AttrHdl == pChar->CccdHdl)
			{
				if (Len == 2 && pData != nullptr)
				{
					uint16_t cccd = (uint16_t)(pData[0] | (pData[1] << 8));
					BtGattCccdSet(ConnHdl, pChar->CccdHdl, cccd);
				}
				return;
			}

			if (AttrHdl == pChar->ValHdl && pChar->WrCB != nullptr)
			{
				pChar->WrCB(pChar, pData, (int)Offset, (int)Len);
				return;
			}
		}
		pSrvc = pSrvc->pNext;
	}
}

// On a bonded reconnection the ST stack restores each subscribed client's CCCD
// from its security database but does not emit ACI_GATT_ATTRIBUTE_MODIFIED for
// the restore, so the notify/indicate re-arm callbacks never fire. Read the
// per-connection CCCD the stack restored and replay each enabled one through
// BtGattCccdSet, which fires SetNotifCB/SetIndCB. This is the WBA equivalent of
// the SDC port's BtGattCccdRestoreBonded, sourced from the stack instead of the
// IOsonata bond table (which ST owns on this port). Called on encryption enabled.
static void WbaGattCccdReArm(uint16_t ConnHdl)
{
	BtGattSrvc_t *pSrvc = BtGattGetSrvcList();

	while (pSrvc != nullptr)
	{
		for (int i = 0; i < pSrvc->NbChar; i++)
		{
			BtGattChar_t *pChar = &pSrvc->pCharArray[i];

			if (pChar->CccdHdl == BT_ATT_HANDLE_INVALID)
			{
				continue;
			}

			uint16_t length = 0;
			uint16_t valLen = 0;
			uint8_t val[2] = { 0, 0 };

			// A Connection_Handle selects the per-connection CCCD instance.
			tBleStatus st = aci_gatt_get_attribute_value(ConnHdl, pChar->CccdHdl,
														 0, sizeof(val),
														 &length, &valLen, val);
			if (st == BLE_STATUS_SUCCESS && valLen == 2)
			{
				uint16_t cccd = (uint16_t)(val[0] | (val[1] << 8));
				if (cccd != 0)
				{
					BtGattCccdSet(ConnHdl, pChar->CccdHdl, cccd);
				}
			}
		}
		pSrvc = pSrvc->pNext;
	}
}

// ===========================================================================
// SMP user interaction bridge (STM32WBA / ST host stack).
//
// The ST stack owns the SMP exchange and surfaces the user steps as ACI GAP
// events: ACI_GAP_NUMERIC_COMPARISON_VALUE (Numeric Comparison) and
// ACI_GAP_PASS_KEY_REQ (Passkey Entry, display or input depending on IO
// capability). These are bridged to the same BtSmp* interaction API the
// generic SMP host exposes, so an application sees one set of callbacks across
// ports. ST passes the passkey as a plain integer, so no ASCII conversion is
// needed. The reply functions route the user answer back through
// aci_gap_numeric_comparison_value_confirm_yesno and aci_gap_pass_key_resp.
// The generic weak defaults live in bt_smp.cpp, which is not linked on this
// port, so equivalent weak defaults are provided here.
// ===========================================================================

// Decide whether the local device displays the passkey (true) or inputs it
// (false), from the local and peer IO capabilities. KeyboardOnly inputs;
// DisplayOnly and DisplayYesNo display; KeyboardDisplay displays only against a
// KeyboardOnly peer.
static bool WbaPasskeyLocalDisplays(uint8_t LocalIo, uint8_t PeerIo)
{
	if (LocalIo == IO_CAP_KEYBOARD_ONLY)
	{
		return false;
	}
	if (LocalIo == IO_CAP_DISPLAY_ONLY || LocalIo == IO_CAP_DISPLAY_YES_NO)
	{
		return true;
	}
	// IO_CAP_KEYBOARD_DISPLAY
	return (PeerIo == IO_CAP_KEYBOARD_ONLY);
}

static void WbaPasskeyReject(uint16_t ConnHdl)
{
	s_WbaData.PasskeyRejectedHdl = ConnHdl;
	(void)aci_gap_terminate(ConnHdl, BT_APP_HCI_AUTH_FAILURE);
}

// Resume Numeric Comparison. Confirm true reports a match, false rejects and
// aborts pairing.
void BtSmpNumericComparisonReply(uint16_t ConnHdl, bool Confirm)
{
	(void)aci_gap_numeric_comparison_value_confirm_yesno(ConnHdl, Confirm ? 1 : 0);
}

// Resume Passkey Entry on the input side. A value in 0..999999 is handed to the
// stack. A value above that range cancels by terminating the pending link with
// Authentication Failure. Sending zero is not a cancellation because 000000 is
// a valid passkey.
void BtSmpPasskeyReply(uint16_t ConnHdl, uint32_t Passkey)
{
	if (Passkey > 999999u)
	{
		WbaPasskeyReject(ConnHdl);
		return;
	}

	s_WbaData.PasskeyRejectedHdl = BT_CONN_HDL_INVALID;
	(void)aci_gap_pass_key_resp(ConnHdl, Passkey);
}

// Set the local SMP IO capability and authentication requirement at runtime,
// the same entry point the SDC and BM ports expose. Maps the generic
// BT_SMP_IOCAPS_* / BT_SMP_AUTHREQ_* values to ST's IO_CAP_* and the split
// arguments of aci_gap_set_authentication_requirement, then applies them so a
// call after BtAppInit reconfigures the next pairing. An AuthReq with the SC
// bit set is configured as SC-only; legacy fallback is not permitted.
void BtSmpAuthConfig(uint8_t IoCaps, uint8_t AuthReq)
{
	uint8_t io;
	switch (IoCaps)
	{
		case BT_SMP_IOCAPS_DISPLAY_ONLY:
			io = IO_CAP_DISPLAY_ONLY;
			break;
		case BT_SMP_IOCAPS_DISPLAY_YESNO:
			io = IO_CAP_DISPLAY_YES_NO;
			break;
		case BT_SMP_IOCAPS_KEYBOARD_ONLY:
			io = IO_CAP_KEYBOARD_ONLY;
			break;
		case BT_SMP_IOCAPS_KEYBOARD_DISPLAY:
			io = IO_CAP_KEYBOARD_DISPLAY;
			break;
		case BT_SMP_IOCAPS_NO_INPUT_NO_OUTPUT:
		default:
			io = IO_CAP_NO_INPUT_NO_OUTPUT;
			break;
	}
	s_WbaData.IoCapability    = io;
	s_WbaData.AuthRequirement = AuthReq;

	uint8_t bonding   = (AuthReq & BT_SMP_AUTHREQ_BONDING_FLAG_MASK) != 0 ? 1 : 0;
	uint8_t mitm      = (AuthReq & BT_SMP_AUTHREQ_MITM) != 0 ? 1 : 0;
	uint8_t scSupport = (AuthReq & BT_SMP_AUTHREQ_SC) != 0 ? 2 : 0;
	aci_gap_set_authentication_requirement(bonding, mitm,
	                                       scSupport,
	                                       0,	// keypress not supported
	                                       SEC_PARAM_MIN_KEY_SIZE,
	                                       SEC_PARAM_MAX_KEY_SIZE,
	                                       0,	// use fixed pin = no
	                                       0,	// fixed pin value
	                                       0);	// identity address type
	aci_gap_set_io_capability(io);
}

// LE Secure Connections OOB data (strong overrides of the generic weak API).
// The ST stack owns the SC key pair: aci_gap_set_oob_data with a zero length
// makes the stack generate its OOB Random and Confirm, and aci_gap_get_oob_data
// extracts them. The peer set is staged here and pushed to the stack at
// connection time, when the peer address is known; without privacy the
// connection address is the identity address the command expects.
// The public staging API has no connection handle, so the staged set is bound
// to the first link that consumes it and cannot be reused by another pairing.
static uint8_t s_BtAppPeerOobRand[16];
static uint8_t s_BtAppPeerOobConf[16];
static bool s_BtAppPeerOobValid = false;
static uint16_t s_BtAppPeerOobHdl = BT_CONN_HDL_INVALID;

static void BtSmpOobDataClearInternal(void)
{
	s_BtAppPeerOobValid = false;
	s_BtAppPeerOobHdl = BT_CONN_HDL_INVALID;
	memset(s_BtAppPeerOobRand, 0, sizeof(s_BtAppPeerOobRand));
	memset(s_BtAppPeerOobConf, 0, sizeof(s_BtAppPeerOobConf));
}

static void BtSmpOobDataClearConn(uint16_t ConnHdl)
{
	if (s_BtAppPeerOobValid && s_BtAppPeerOobHdl == ConnHdl)
	{
		BtSmpOobDataClearInternal();
	}
}

