IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
int BtSmpOobLocalDataGen(BtHciDevice_t * const pDev, uint8_t * const pRand, uint8_t * const pConf)
{
	(void)pDev;

	if (!s_WbaData.bOobEnabled || pRand == NULL || pConf == NULL ||
		s_BtAppPeerOobHdl != BT_CONN_HDL_INVALID)
	{
		return -1;
	}

	uint8_t zaddr[6] = {0};

	// Length 0 = generate a fresh SC Random/Confirm pair in the stack.
	if (aci_gap_set_oob_data(0, 0, zaddr, 0, 0, NULL) != BLE_STATUS_SUCCESS)
	{
		return -1;
	}

	uint8_t atype;
	uint8_t addr[6];
	uint8_t len;

	// OOB_Data_Type 1 = SC Random, 2 = SC Confirm.
	if (aci_gap_get_oob_data(1, &atype, addr, &len, pRand) != BLE_STATUS_SUCCESS ||
		len != 16)
	{
		return -1;
	}
	if (aci_gap_get_oob_data(2, &atype, addr, &len, pConf) != BLE_STATUS_SUCCESS ||
		len != 16)
	{
		return -1;
	}

	return 0;
}

void BtSmpOobPeerDataSet(const uint8_t * const pRand, const uint8_t * const pConf)
{
	if (!s_WbaData.bOobEnabled || pRand == NULL || pConf == NULL)
	{
		return;
	}

	if (s_BtAppPeerOobValid && s_BtAppPeerOobHdl != BT_CONN_HDL_INVALID &&
		BtPeerFindByHdl(s_BtAppPeerOobHdl) != nullptr)
	{
		DEBUG_PRINTF("SEC: OOB data already owned by hdl=%u\r\n",
					 s_BtAppPeerOobHdl);
		return;
	}

	BtSmpOobDataClearInternal();
	memcpy(s_BtAppPeerOobRand, pRand, sizeof(s_BtAppPeerOobRand));
	memcpy(s_BtAppPeerOobConf, pConf, sizeof(s_BtAppPeerOobConf));
	s_BtAppPeerOobValid = true;
}

void BtSmpOobDataClear(void)
{
	if (s_BtAppPeerOobValid && s_BtAppPeerOobHdl != BT_CONN_HDL_INVALID &&
		BtPeerFindByHdl(s_BtAppPeerOobHdl) != nullptr)
	{
		DEBUG_PRINTF("SEC: OOB data busy on hdl=%u\r\n",
					 s_BtAppPeerOobHdl);
		return;
	}

	BtSmpOobDataClearInternal();
}

// Push the staged peer OOB data into the stack for this link. Called from the
// connection complete event, before any pairing initiation. Reserve the data
// before issuing either ACI command so a partial command failure cannot make
// the same peer values available to another link.
static void BtAppOobPeerDataPush(uint16_t ConnHdl, uint8_t AddrType,
								 const uint8_t *pAddr)
{
	if (!s_WbaData.bOobEnabled || !g_BtAppData.AppDevice.bSecure ||
		!s_BtAppPeerOobValid || pAddr == NULL)
	{
		return;
	}
	if (s_BtAppPeerOobHdl != BT_CONN_HDL_INVALID &&
		s_BtAppPeerOobHdl != ConnHdl)
	{
		DEBUG_PRINTF("SEC: OOB data busy on hdl=%u, reject hdl=%u\r\n",
					 s_BtAppPeerOobHdl, ConnHdl);
		return;
	}

	s_BtAppPeerOobHdl = ConnHdl;
	tBleStatus randStatus = aci_gap_set_oob_data(1, AddrType, pAddr, 1, 16,
											  s_BtAppPeerOobRand);
	tBleStatus confStatus = aci_gap_set_oob_data(1, AddrType, pAddr, 2, 16,
											  s_BtAppPeerOobConf);
	if (randStatus != BLE_STATUS_SUCCESS || confStatus != BLE_STATUS_SUCCESS)
	{
		DEBUG_PRINTF("SEC: set OOB data failed hdl=%u rand=0x%02X conf=0x%02X\r\n",
					 ConnHdl, randStatus, confStatus);
	}
}

// The rejecting defaults for BtSmpNumericComparison, BtSmpPasskeyDisplay and
// BtSmpPasskeyRequest are weak in bt_smp.cpp, which this port links for
// BtSmpTimeoutCheck at the end of this file. A second weak definition here
// left the choice to link order. Both reach this port through the strong
// BtSmpNumericComparisonReply and BtSmpPasskeyReply above, and the display
// default that called WbaPasskeyReject arrives at the same place, since
// BtSmpPasskeyReply routes an out of range passkey there.

// HCI event callback registered with the stack. ST's stack invokes this
// for every HCI / vendor event; we route by type to the appropriate
// handler. Adv-report events go to the scan path (handled in
// bt_scan_stm32wba.cpp via a separately registered observer).
static SVCCTL_UserEvtFlowStatus_t BtAppHciEvtHandler(void *pPayload)
{
	hci_event_pckt *pEvtPkt = (hci_event_pckt *)((hci_uart_pckt *)pPayload)->data;

	switch (pEvtPkt->evt)
	{
		case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
		{
			hci_disconnection_complete_event_rp0 *p =
				(hci_disconnection_complete_event_rp0 *)pEvtPkt->data;
			if (p->Status == BLE_STATUS_SUCCESS)
			{
				if (s_WbaData.PasskeyRejectedHdl == p->Connection_Handle)
				{
					s_WbaData.PasskeyRejectedHdl = BT_CONN_HDL_INVALID;
				}
				BtSmpOobDataClearConn(p->Connection_Handle);
				BtDevice_t *pPeer = BtPeerFindByHdl(p->Connection_Handle);
				if (pPeer != nullptr)
				{
					BtPeerFree(pPeer);
					bool connected = BtPeerIsConnected();

					if (connected)
					{
						g_BtAppData.State = BTAPP_STATE_CONNECTED;
						BtAppConnLedOn();
					}
					else
					{
						g_BtAppData.State = BTAPP_STATE_IDLE;
						BtAppConnLedOff();
					}

					BtAppEvtDisconnected(p->Connection_Handle);
				}

				// A disconnect can free either peripheral capacity or the last
				// peer-table slot. BtAdvStart performs both checks and is a no-op
				// when the advertising set is already active.
				BtAdvStart();
			}
			break;
		}

		case HCI_ENCRYPTION_CHANGE_EVT_CODE:
		{
			hci_encryption_change_event_rp0 *p =
				(hci_encryption_change_event_rp0 *)pEvtPkt->data;
			// Link encrypted. On a bonded reconnect the stack has restored the
			// peer's CCCDs by this point, so re-arm the notify/indicate callbacks.
			// On a fresh pairing the CCCDs are still clear, so this is a no-op and
			// the later client subscribe drives the callbacks instead.
			if (p->Status == 0 && p->Encryption_Enabled != 0 &&
				BtPeerFindByHdl(p->Connection_Handle) != nullptr)
			{
				WbaGattCccdReArm(p->Connection_Handle);
			}
			break;
		}

		case HCI_LE_META_EVT_CODE:
		{
			evt_le_meta_event *pMeta = (evt_le_meta_event *)pEvtPkt->data;
			switch (pMeta->subevent)
			{
				case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
				{
					hci_le_connection_complete_event_rp0 *p =
						(hci_le_connection_complete_event_rp0 *)pMeta->data;
					if (p->Status == BLE_STATUS_SUCCESS)
					{
						// Own address not stamped: SMP runs in the ST host, not
						// the IOsonata toolbox, so the record is left for the
						// BtSmpLocalAddrGet fallback.
						BtDevice_t *pPeer = BtPeerConnected(p->Connection_Handle,
						                   p->Role,
						                   p->Peer_Address_Type,
						                   p->Peer_Address,
						                   0, NULL);

						if (p->Role == BT_CONN_ROLE_PERIPHERAL)
						{
							// A connectable advertising set stops after creating this
							// link. Update the local set state before deciding whether
							// another peripheral link may be accepted.
							BtAdvWbaConnected();
						}

						if (pPeer == nullptr)
						{
							// BtPeerConnected already routes rejection through
							// BtPeerConnectionRejected, which terminates the link.
							break;
						}

						g_BtAppData.State = BTAPP_STATE_CONNECTED;
						BtAppConnLedOn();
						BtAppEvtConnected(p->Connection_Handle);

						// Secure link setup. ST owns the SMP exchange and emits
						// ACI_GAP_PAIRING_COMPLETE, which surfaces below as
						// BtAppEvtSecured. A central starts pairing directly; a
						// peripheral asks the central with a Security Request.
						if (g_BtAppData.AppDevice.bSecure)
						{
							// Only a LESC link configured for OOB may claim the
							// single staged peer OOB set.
							if (s_WbaData.bOobEnabled)
							{
								BtAppOobPeerDataPush(p->Connection_Handle,
								                     p->Peer_Address_Type,
								                     p->Peer_Address);
							}

