IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
							switch (p->Role)
							{
								case BT_CONN_ROLE_CENTRAL:
									aci_gap_send_pairing_req(p->Connection_Handle, 0);
									break;

								case BT_CONN_ROLE_PERIPHERAL:
									aci_gap_slave_security_req(p->Connection_Handle);
									break;

								default:
									break;
							}
						}

						if (p->Role == BT_CONN_ROLE_PERIPHERAL)
						{
							BtAdvStart();
						}
					}
					break;
				}

				case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
					// Adv reports handled by the scan path.
					break;

				case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
					// Conn-param updates handled by bt_cp_stm32wba.cpp.
					break;

				default:
					break;
			}
			break;
		}

		case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
		{
			evt_blecore_aci *pAci = (evt_blecore_aci *)pEvtPkt->data;
			switch (pAci->ecode)
			{
				case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
					WbaDiscSrvc((aci_att_read_by_group_type_resp_event_rp0 *)pAci->data);
					break;

				case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
					WbaDiscChar((aci_att_read_by_type_resp_event_rp0 *)pAci->data);
					break;

				case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
					WbaDiscDesc((aci_att_find_info_resp_event_rp0 *)pAci->data);
					break;

				case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
					WbaDiscProcComplete((aci_gatt_proc_complete_event_rp0 *)pAci->data);
					break;

				case ACI_GATT_NOTIFICATION_VSEVT_CODE:
				{
					aci_gatt_notification_event_rp0 *pN =
						(aci_gatt_notification_event_rp0 *)pAci->data;
					BtGattClientNotified(pN->Connection_Handle, pN->Attribute_Handle,
										 pN->Attribute_Value, pN->Attribute_Value_Length);
					break;
				}

				case ACI_GATT_INDICATION_VSEVT_CODE:
				{
					aci_gatt_indication_event_rp0 *pI =
						(aci_gatt_indication_event_rp0 *)pAci->data;
					BtGattClientNotified(pI->Connection_Handle, pI->Attribute_Handle,
										 pI->Attribute_Value, pI->Attribute_Value_Length);
					// ST requires the client to confirm a received indication.
					aci_gatt_confirm_indication(pI->Connection_Handle);
					break;
				}

				case ACI_GATT_SERVER_CONFIRMATION_VSEVT_CODE:
				{
					// The client confirmed our indication. Clear the pending state
					// and drain the send-order ring so TxCompleteCB fires.
					uint16_t ch = *(uint16_t*)pAci->data;
					BtGattHandleValueConfirm(ch);
					BtGattSendCompleted(ch, 1);
					break;
				}

				case ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE:
				{
					aci_gatt_attribute_modified_event_rp0 *pM =
						(aci_gatt_attribute_modified_event_rp0 *)pAci->data;
					WbaGattAttrModified(pM->Connection_Handle, pM->Attr_Handle,
										pM->Offset, pM->Attr_Data, pM->Attr_Data_Length);
					break;
				}

				case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
				{
					aci_gap_pairing_complete_event_rp0 *pPc =
						(aci_gap_pairing_complete_event_rp0 *)pAci->data;
					if (s_WbaData.PasskeyRejectedHdl == pPc->Connection_Handle)
					{
						s_WbaData.PasskeyRejectedHdl = BT_CONN_HDL_INVALID;
					}
					BtSmpOobDataClearConn(pPc->Connection_Handle);
					if (pPc->Status == 0)
					{
						BtAppEvtSecured(pPc->Connection_Handle);
					}
					break;
				}

				case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
				{
					aci_gap_numeric_comparison_value_event_rp0 *pNc =
						(aci_gap_numeric_comparison_value_event_rp0 *)pAci->data;
					// LESC Numeric Comparison: the application confirms the
					// match through BtSmpNumericComparisonReply.
					BtSmpNumericComparison(pNc->Connection_Handle, pNc->Numeric_Value);
					break;
				}

				case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
				{
					aci_gap_pass_key_req_event_rp0 *pPk =
						(aci_gap_pass_key_req_event_rp0 *)pAci->data;
					uint16_t connHdl = pPk->Connection_Handle;
					s_WbaData.PasskeyRejectedHdl = BT_CONN_HDL_INVALID;
					// The event reports the peer IO capability; the local one is
					// the configured value.
					if (WbaPasskeyLocalDisplays(s_WbaData.IoCapability, pPk->IO_Capability))
					{
						// Display side: generate a six digit passkey, show it,
						// and hand the same value to the stack unless the callback
						// rejected synchronously.
						uint8_t rnd[8] = {0};
						(void)BtWbaLeRand(rnd);
						uint32_t val = ((uint32_t)rnd[0] | ((uint32_t)rnd[1] << 8) |
										((uint32_t)rnd[2] << 16) | ((uint32_t)rnd[3] << 24)) % 1000000u;
						BtSmpPasskeyDisplay(connHdl, val);
						if (s_WbaData.PasskeyRejectedHdl != connHdl)
						{
							(void)aci_gap_pass_key_resp(connHdl, val);
						}
					}
					else
					{
						// Input side: the application provides the value the user
						// reads from the peer through BtSmpPasskeyReply.
						BtWbaPasskeyRequest(connHdl);
					}
					break;
				}

				default:
					break;
			}
			break;
		}

		default:
			break;
	}

	return SVCCTL_UserEvtFlowEnable;
}

// --- Stack sizing ---
//
// Every number can come from the application's app_conf.h in ST's own macro
// names; what is not said gets a default that fits the examples. The buffer
// sizes then follow from ble_bufsize.h, so the numbers are stated once and
// the buffers cannot disagree with them.

#ifndef CFG_BLE_NUM_LINK
#define CFG_BLE_NUM_LINK				2
#endif
#ifndef CFG_BLE_NUM_GATT_SERVICES
#define CFG_BLE_NUM_GATT_SERVICES		8
#endif
#ifndef CFG_BLE_NUM_GATT_ATTRIBUTES
#define CFG_BLE_NUM_GATT_ATTRIBUTES		68
#endif
#ifndef CFG_BLE_ATT_VALUE_ARRAY_SIZE
#define CFG_BLE_ATT_VALUE_ARRAY_SIZE	1344
#endif
#ifndef CFG_BLE_ATT_MTU_MAX
#define CFG_BLE_ATT_MTU_MAX				251
#endif
#ifndef CFG_BLE_PREPARE_WRITE_LIST_SIZE
#define CFG_BLE_PREPARE_WRITE_LIST_SIZE	BLE_DEFAULT_PREP_WRITE_LIST_SIZE
#endif
#ifndef CFG_BLE_MBLOCK_COUNT
#define CFG_BLE_MBLOCK_COUNT			BLE_MBLOCKS_CALC(CFG_BLE_PREPARE_WRITE_LIST_SIZE, \
										CFG_BLE_ATT_MTU_MAX, CFG_BLE_NUM_LINK)
#endif
#ifndef CFG_BLE_OPTIONS
#define CFG_BLE_OPTIONS					0
#endif

// The stack's NVM cache: bonds and GATT server state, preloaded from the
// PDS before init and persisted through BLEPLAT_NvmStore. In 64 bit words,
// 1..1024 per blestack.h.
#ifndef CFG_BLE_NVM_MAX_SIZE
#define CFG_BLE_NVM_MAX_SIZE			512
#endif

// Host event FIFO, in 16 bit words.
#ifndef CFG_BLE_HOST_EVT_FIFO_SIZE
#define CFG_BLE_HOST_EVT_FIFO_SIZE		256
#endif

