IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
// The RAM the stack runs in, sized by the middleware's own arithmetic from
// the numbers above. 32 bit aligned per blestack.h.
static uint32_t s_BleStackRam[DIVC(BLE_TOTAL_BUFFER_SIZE(CFG_BLE_NUM_LINK,
									CFG_BLE_MBLOCK_COUNT, 0), 4)];
static uint32_t s_BleGattRam[DIVC(BLE_TOTAL_BUFFER_SIZE_GATT(
									CFG_BLE_NUM_GATT_ATTRIBUTES,
									CFG_BLE_NUM_GATT_SERVICES,
									CFG_BLE_ATT_VALUE_ARRAY_SIZE), 4)];
static uint64_t s_BleNvmCache[CFG_BLE_NVM_MAX_SIZE];
static uint16_t s_BleHostEvtFifo[CFG_BLE_HOST_EVT_FIFO_SIZE];

// Preload the cache from the PDS and say how many words came back.
// Implemented in bt_smp_bond_stm32wba.cpp; weak no-op here so a build
// without security still links and starts with an empty cache.
extern "C" __attribute__((weak))
uint16_t BtSmpBondWbaCacheInit(uint64_t *pCache, uint16_t MaxWords)
{
	(void)pCache;
	(void)MaxWords;
	return 0;
}

// --- Public API ---

bool BtAppStackInit(const BtAppCfg_t *pCfg)
{
	if (s_WbaData.bStackInited)
	{
		return true;
	}

	// System Clock Manager - registers the BLE radio domain so SCM picks
	// the right clocks when the radio is active.
	scm_init();

	// Link Layer hardware setup. ll_sys_thread_init runs the radio task,
	// ll_sys_dependencies_init wires RNG/AES/PKA into the link layer.
	ll_sys_thread_init();
	ll_sys_dependencies_init();

	// Public-key accelerator for LESC pairing. Safe to init even if SMP
	// isn't enabled; the stack just won't use it.
	BPKA_Reset();

	// The bond store mounts and preloads the stack's NVM cache before the
	// stack initializes, because BleStack_init_t takes the preloaded word
	// count: nvm_cache_size is what the restore answered. A first boot, a
	// torn flush or a store that would not mount all answer 0 and the
	// stack starts empty. Guarded on the security type the way the Nordic
	// ports guard on bSecure; without security the weak no-op answers and
	// nothing is pulled in.
	if (pCfg->SecType != BTGAP_SECTYPE_NONE)
	{
		s_WbaData.NvmCacheWords =
				BtSmpBondWbaCacheInit(s_BleNvmCache, CFG_BLE_NVM_MAX_SIZE);
	}

	// Host stack bring-up, sized by the numbers above; an app_conf.h that
	// says its own CFG_BLE_* wins over every default.
	BleStack_init_t init;

	memset(&init, 0, sizeof(init));

	init.bleStartRamAddress = (uint8_t *)s_BleStackRam;
	init.total_buffer_size = sizeof(s_BleStackRam);
	init.bleStartRamAddress_GATT = (uint8_t *)s_BleGattRam;
	init.total_buffer_size_GATT = sizeof(s_BleGattRam);
	init.nvm_cache_buffer = s_BleNvmCache;
	init.nvm_cache_size = s_WbaData.NvmCacheWords;
	init.nvm_cache_max_size = CFG_BLE_NVM_MAX_SIZE;
	init.host_event_fifo_buffer = s_BleHostEvtFifo;
	init.host_event_fifo_buffer_size = CFG_BLE_HOST_EVT_FIFO_SIZE;
	init.numAttrRecord = CFG_BLE_NUM_GATT_ATTRIBUTES;
	init.numAttrServ = CFG_BLE_NUM_GATT_SERVICES;
	init.attrValueArrSize = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
	init.numOfLinks = CFG_BLE_NUM_LINK;
	init.prWriteListSize = CFG_BLE_PREPARE_WRITE_LIST_SIZE;
	init.mblockCount = CFG_BLE_MBLOCK_COUNT;
	init.attMtu = CFG_BLE_ATT_MTU_MAX;
	init.options = CFG_BLE_OPTIONS;

	uint8_t ret = BleStack_Init(&init);
	if (ret != BLE_STATUS_SUCCESS)
	{
		DEBUG_PRINTF("BleStack_Init failed: 0x%02x\r\n", ret);
		return false;
	}

	// Register the central HCI event handler with the SVCCTL dispatcher.
	BtWbaEventRouterRegister(BtAppHciEvtHandler);

	// Sequencer tasks for HCI-evt drain + BLE host work. These match the
	// notification hooks above (hci_notify_asynch_evt, BLE_RESUME_FLOW).
	UTIL_SEQ_RegTask(1U << BT_APP_TASK_HCI_USER_EVT, UTIL_SEQ_RFU,
	                 HciUserEvtProcessTask);
	UTIL_SEQ_RegTask(1U << BT_APP_TASK_BLE_HOST,     UTIL_SEQ_RFU,
	                 BleHostTask);

	// Set TX power if requested. ACI value is -128..+127 dBm (signed
	// int8), but the stack rounds to the closest supported level.
	if (pCfg->TxPower != 0)
	{
		aci_hal_set_tx_power_level(0, (uint8_t)pCfg->TxPower);
	}

	s_WbaData.bStackInited = true;
	return true;
}

bool BtAppInit(const BtAppCfg_t *pCfg)
{
	if (pCfg == NULL)
	{
		return false;
	}

	BtSmpOobDataClearInternal();
	s_WbaData.PasskeyRejectedHdl = BT_CONN_HDL_INVALID;
	s_WbaData.bOobEnabled =
		pCfg->SecType == BTGAP_SECTYPE_LESC_MITM &&
		(pCfg->SecExchg & BTAPP_SECEXCHG_OOB) != 0;

	// Initialize application event handler queue.
	if (AppEvtHandlerInit(pCfg->pEvtHandlerQueMem,
	                      pCfg->EvtHandlerQueMemSize) == false)
	{
		return false;
	}

	// Initialize peer manager.
	if (!BtPeerInit(pCfg->pPeerPoolMem, pCfg->PeerPoolMemSize))
	{
		return false;
	}

	// Connection pool removed: the peer manager (BtPeerInit above) owns
	// the single connection table now.
	// Populate generic app data from cfg.
	g_BtAppData.AppDevice.Conn.Role = pCfg->Role;
	g_BtAppData.AdvHdl          = 0;	// WBA stack manages adv internally
	g_BtAppData.bExtAdv         = pCfg->bExtAdv;
	g_BtAppData.ConnLedPort     = pCfg->ConnLedPort;
	g_BtAppData.ConnLedPin      = pCfg->ConnLedPin;
	g_BtAppData.ConnLedActLevel = pCfg->ConnLedActLevel;
	g_BtAppData.bScan           = false;
	g_BtAppData.AppDevice.VendorId   = pCfg->VendorId;
	g_BtAppData.AppDevice.ProductId  = pCfg->ProductId;
	g_BtAppData.AppDevice.ProductVer = pCfg->ProductVer;
	g_BtAppData.AppDevice.Appearance = pCfg->Appearance;

	g_BtAppData.AppDevice.Conn.MaxMtu = GATT_MTU_SIZE_DEFAULT;
	if (pCfg->MaxMtu > GATT_MTU_SIZE_DEFAULT)
	{
		g_BtAppData.AppDevice.Conn.MaxMtu = pCfg->MaxMtu;
	}

	// Connection LED.
	if (pCfg->ConnLedPort != -1 && pCfg->ConnLedPin != -1)
	{
		IOPinConfig(pCfg->ConnLedPort, pCfg->ConnLedPin, 0,
		            IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);
		BtAppConnLedOff();
	}

	// Bring up the stack.
	if (BtAppStackInit(pCfg) == false)
	{
		DEBUG_PRINTF("BtAppStackInit failed\r\n");
		return false;
	}

	// GATT must be initialized before GAP - ST's stack uses GATT handles
	// internally during GAP service creation.
	uint8_t ret = aci_gatt_init();
	if (ret != BLE_STATUS_SUCCESS)
	{
		DEBUG_PRINTF("aci_gatt_init: 0x%02x\r\n", ret);
		return false;
	}

	// GAP init creates the GAP service and returns its handles. ST puts
	// device-name + appearance chars in the service automatically.
	uint16_t gapSrvcHdl, devNameHdl, appearanceHdl;
	uint8_t role = 0;
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)  role |= GAP_PERIPHERAL_ROLE;
	if (pCfg->Role & BTAPP_ROLE_CENTRAL)     role |= GAP_CENTRAL_ROLE;
	if (pCfg->Role & BTAPP_ROLE_OBSERVER)    role |= GAP_OBSERVER_ROLE;
	if (pCfg->Role & BTAPP_ROLE_BROADCASTER) role |= GAP_BROADCASTER_ROLE;

