IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
	ret = BtWbaGapInitCapture(role,
	                   0x00,	// privacy disabled by default
	                   (uint8_t)(pCfg->pDevName ? strlen(pCfg->pDevName) : 0),
	                   &gapSrvcHdl, &devNameHdl, &appearanceHdl);
	if (ret != BLE_STATUS_SUCCESS)
	{
		DEBUG_PRINTF("aci_gap_init: 0x%02x\r\n", ret);
		return false;
	}
	s_WbaData.GattSrvcStartHdl = gapSrvcHdl;

	// Push the device name into the GAP service char value.
	if (pCfg->pDevName != NULL)
	{
		BtWbaGattUpdateCharValue(gapSrvcHdl, devNameHdl,
		                           0, (uint8_t)strlen(pCfg->pDevName),
		                           (uint8_t *)pCfg->pDevName);
	}

	// Appearance.
	uint16_t appearance = pCfg->Appearance;
	BtWbaGattUpdateCharValue(gapSrvcHdl, appearanceHdl,
	                           0, sizeof(appearance), (uint8_t *)&appearance);

	// Store the app security type so the GATT layer can gate characteristic
	// permissions before user services are registered.
	g_BtAppData.SecType = pCfg->SecType;

	// SMP / pairing config. Map BtGap SecType to ST auth requirement.
	uint8_t authReq      = 0;	// bonding NO, MITM NO by default
	uint8_t scSupport    = 0;	// LE Secure Connections off by default
	switch (pCfg->SecType)
	{
		case BTGAP_SECTYPE_STATICKEY_MITM:
		case BTGAP_SECTYPE_SIGNED_MITM:
			authReq = 0x05;	// bonding + MITM
			break;
		case BTGAP_SECTYPE_LESC_MITM:
			authReq   = 0x05;
			scSupport = 2;	// SC-only, no legacy fallback
			break;
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
			authReq = 0x01;	// bonding, no MITM (encryption without authentication)
			break;
		case BTGAP_SECTYPE_NONE:
		default:
			authReq = 0;
			break;
	}
	s_WbaData.AuthRequirement = authReq;

	aci_gap_set_authentication_requirement(authReq & 0x01,	// bonding
	                                       (authReq >> 2) & 0x01,	// MITM
	                                       scSupport,
	                                       0,	// keypress not supported
	                                       SEC_PARAM_MIN_KEY_SIZE,
	                                       SEC_PARAM_MAX_KEY_SIZE,
	                                       0,	// use fixed pin = no
	                                       0,	// fixed pin value
	                                       0);	// identity address type

	// Map the application key-exchange capability to the ST IO capability so the
	// MITM models (Numeric Comparison, Passkey Entry) can be selected. With no
	// exchange bits the configured default (No Input No Output) stays.
	uint8_t ioExchg = pCfg->SecExchg &
			(BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO);
	switch (ioExchg)
	{
		case BTAPP_SECEXCHG_KEYBOARD:
			s_WbaData.IoCapability = IO_CAP_KEYBOARD_ONLY;
			break;
		case BTAPP_SECEXCHG_DISPLAY:
			s_WbaData.IoCapability = IO_CAP_DISPLAY_ONLY;
			break;
		case (BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			s_WbaData.IoCapability = IO_CAP_DISPLAY_YES_NO;
			break;
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY):
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			s_WbaData.IoCapability = IO_CAP_KEYBOARD_DISPLAY;
			break;
		default:
			break;
	}

	aci_gap_set_io_capability(s_WbaData.IoCapability);

	// Generic GAP init - sets up the generic-layer GAP/GATT service mirror.
	BtGapCfg_t gapcfg = {
		.Role            = pCfg->Role,
		.SecType         = pCfg->SecType,
		.AdvInterval     = pCfg->AdvInterval,
		.AdvTimeout      = pCfg->AdvTimeout,
		.ConnIntervalMin = pCfg->ConnIntervalMin,
		.ConnIntervalMax = pCfg->ConnIntervalMax,
		.SlaveLatency    = BT_GAP_CONN_SLAVE_LATENCY,
		.SupTimeout      = BT_GAP_CONN_SUP_TIMEOUT
	};
	// The GAP and GATT services are the table a client reads first. Without
	// them there is nothing to advertise, so this stops here.
	if (BtGapInit(&gapcfg) == false)
	{
		return false;
	}

	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	// User services + DIS + user data, in the order the BM port uses.
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		BtAppInitUserServices();
	}

	if (pCfg->pDevInfo != NULL)
	{
		BtDisInit((const struct __Bt_App_Cfg *)pCfg);
	}

	BtAppInitUserData();

	g_BtAppData.AppDevice.bSecure = (pCfg->SecType != BTGAP_SECTYPE_NONE);

	// Advertising init - actual ACI calls live in bt_adv_stm32wba.cpp.
	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		if (BtAppAdvInit(pCfg) == false)
		{
			DEBUG_PRINTF("BtAppAdvInit failed\r\n");
			return false;
		}
	}

	g_BtAppData.State = BTAPP_STATE_INITIALIZED;
	DEBUG_PRINTF("BtAppInit: success\r\n");
	return true;
}

// Millisecond clock for the generic SMP/GATT transaction timeouts, overriding
// the weak BtSmpMsTick/BtGattMsTick defaults. Sourced from the STM32 HAL tick
// (HAL_GetTick, milliseconds since boot). Declared in bt_smp.h / bt_gatt.h, so
// no linkage specifier is needed here.
uint32_t BtSmpMsTick(void)
{
	return HAL_GetTick();
}

uint32_t BtGattMsTick(void)
{
	return HAL_GetTick();
}

// Spec-strict indication transaction timeout: Core Vol 3 Part F 3.3.3 requires
// closing the bearer, so terminate the link. Overrides the generic weak
// default that only clears the outstanding-indication flag.
void BtGattIndicationTimeout(uint16_t ConnHdl)
{
	aci_gap_terminate(ConnHdl, 0x13);	// remote user terminated connection
}

void BtAppRun(void)
{
	if (g_BtAppData.State != BTAPP_STATE_INITIALIZED)
	{
		return;
	}

	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		BtAdvStart();
	}

	DEBUG_PRINTF("BtAppRun: entering main loop\r\n");

	while (1)
	{
		// Run any user-queued events first - matches BM/nRF52 ordering.
		AppEvtHandlerExec();

		// Pump the sequencer. UTIL_SEQ_Run dispatches whichever task the
		// notification hooks scheduled (HCI evt drain, BLE host work).
		UTIL_SEQ_Run(UTIL_SEQ_DEFAULT);

		// Drive the generic transaction timeouts (Core Vol 3 Part H 3.4, Part F
		// 3.3.3). Cheap no-ops when nothing is pending. NOTE: this loop wakes on
		// events, so a link that goes fully silent needs a periodic tick to also
		// call these - schedule a repeating UTIL_TIMER/HW_TS task if required.
		BtSmpTimeoutCheck();
		BtGattIndicationTimeoutCheck();

		BtAppEvtWait();
	}
}

