IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
// Generic-layer BtAppEvtDispatch override - drains queued stack work
// without waiting. Called by RTOS bridge code after BtAppEvtNotify.
__attribute__((weak)) void BtAppEvtDispatch(void)
{
	UTIL_SEQ_Run(UTIL_SEQ_DEFAULT);
}

// Bare-metal default: wait for any event. RTOS apps override with a
// semaphore-take in the bridge code (same pattern as BM/nRF52 ports).
// In the default HAL configuration the SysTick interrupt (1 ms, required by
// HAL_GetTick) ends this wait, so the loop reaches the SMP/GATT transaction
// timeout checks even on a fully silent link. A low power build that stops
// SysTick must provide another periodic wakeup (LPTIM or RTC) for the 30 s
// timeouts to fire.
__attribute__((weak)) void BtAppEvtWait(void)
{
	__WFE();
}

// BtAppNotify/BtAppIndicate, their Conn and All forms are the shared weak
// implementations in src/bluetooth/bt_app.cpp. This port used to carry a copy
// that sent to the active connection. What stays here is the disconnect
// command, which is the one part only this port can issue.

void BtAppDisconnectConn(uint16_t ConnHdl)
{
	if (ConnHdl != BT_CONN_HDL_INVALID)
	{
		aci_gap_terminate(ConnHdl, 0x13);	// remote user term
	}
}

void BtAppGapDeviceNameSet(const char *pDeviceName)
{
	if (pDeviceName == NULL || s_WbaData.GattSrvcStartHdl == 0)
	{
		return;
	}

	// Device name char is at offset 0x0002 from the GAP service start
	// handle in ST's standard GAP service layout.
	uint16_t devNameHdl = s_WbaData.GattSrvcStartHdl + 2;
	BtWbaGattUpdateCharValue(s_WbaData.GattSrvcStartHdl, devNameHdl,
	                           0, (uint8_t)strlen(pDeviceName),
	                           (uint8_t *)pDeviceName);
	BtGapSetDevName(pDeviceName);
}

void BtAppEnterDfu(void)
{
	// STM32WBA exposes the system bootloader at 0x0BF88000. Apps that
	// want OTA DFU typically jump there via a vector remap. Implementation
	// is board-specific - left to the app.
}

// Extract a 16-bit UUID (or the 16-bit alias of a 128-bit UUID) from an event
// field that is Len bytes long, little-endian on air. A 128-bit UUID holds
// its 16-bit alias at byte offset 12..13 (standard base layout, also used by
// the BlueIO base), matching the 16-bit storage the GATT DB uses.
static uint16_t WbaUuid16(const uint8_t *pUuid, uint8_t Len)
{
	if (Len <= 2)
	{
		return (uint16_t)(pUuid[0] | (pUuid[1] << 8));
	}
	return (uint16_t)(pUuid[12] | (pUuid[13] << 8));
}

// Parse one ACI_ATT_READ_BY_GROUP_TYPE_RESP (primary service discovery). Each
// entry is Start(2) End(2) UUID(2 or 16); entry length is Attribute_Data_Length
// (6 for 16-bit, 20 for 128-bit).
static void WbaDiscSrvc(const aci_att_read_by_group_type_resp_event_rp0 *p)
{
	BtDevice_t *pDev = BtPeerFindByHdl(p->Connection_Handle);
	if (pDev == nullptr)
	{
		return;
	}

	uint8_t entryLen = p->Attribute_Data_Length;
	uint8_t total    = p->Data_Length;
	if (entryLen < 6)
	{
		return;
	}
	uint8_t uuidLen = (uint8_t)(entryLen - 4);

	for (uint8_t off = 0; (uint16_t)(off + entryLen) <= total; off += entryLen)
	{
		if (pDev->NbSrvc >= BT_DEV_SERVICE_MAXCNT)
		{
			break;
		}
		const uint8_t *e = &p->Attribute_Data_List[off];
		BtGattDBSrvc_t *pSrvc = &pDev->Services[pDev->NbSrvc];
		pSrvc->srv_uuid.BaseIdx = 0;
		pSrvc->srv_uuid.Type    = BT_UUID_TYPE_16;
		pSrvc->srv_uuid.Uuid    = WbaUuid16(&e[4], uuidLen);
		pSrvc->handle_range.StartHdl = (uint16_t)(e[0] | (e[1] << 8));
		pSrvc->handle_range.EndHdl   = (uint16_t)(e[2] | (e[3] << 8));
		pSrvc->char_count = 0;
		pDev->NbSrvc++;
	}
}

// Parse one ACI_ATT_READ_BY_TYPE_RESP (characteristic discovery). Each entry is
// DeclHandle(2) Properties(1) ValueHandle(2) UUID(2 or 16); entry length is
// Handle_Value_Pair_Length (7 for 16-bit, 21 for 128-bit).
static void WbaDiscChar(const aci_att_read_by_type_resp_event_rp0 *p)
{
	BtDevice_t *pDev = BtPeerFindByHdl(p->Connection_Handle);
	if (pDev == nullptr || pDev->Discovery.SrvIdx >= pDev->NbSrvc)
	{
		return;
	}
	BtGattDBSrvc_t *pSrvc = &pDev->Services[pDev->Discovery.SrvIdx];

	uint8_t entryLen = p->Handle_Value_Pair_Length;
	uint8_t total    = p->Data_Length;
	if (entryLen < 7)
	{
		return;
	}
	uint8_t uuidLen = (uint8_t)(entryLen - 5);

	for (uint8_t off = 0; (uint16_t)(off + entryLen) <= total; off += entryLen)
	{
		if (pSrvc->char_count >= BT_GATT_DB_MAX_CHARS)
		{
			break;
		}
		const uint8_t *e = &p->Handle_Value_Pair_Data[off];
		BtGattDBChar_t *pCh = &pSrvc->characteristics[pSrvc->char_count];
		uint8_t props = e[2];

		pCh->characteristic.uuid.BaseIdx = 0;
		pCh->characteristic.uuid.Type    = BT_UUID_TYPE_16;
		pCh->characteristic.uuid.Uuid    = WbaUuid16(&e[5], uuidLen);

		pCh->characteristic.char_props.broadcast      = (props >> 0) & 1;
		pCh->characteristic.char_props.read           = (props >> 1) & 1;
		pCh->characteristic.char_props.write_wo_resp  = (props >> 2) & 1;
		pCh->characteristic.char_props.write          = (props >> 3) & 1;
		pCh->characteristic.char_props.notify         = (props >> 4) & 1;
		pCh->characteristic.char_props.indicate       = (props >> 5) & 1;
		pCh->characteristic.char_props.auth_signed_wr = (props >> 6) & 1;
		pCh->characteristic.char_ext_props            = (props >> 7) & 1;

		pCh->characteristic.handle_decl  = (uint16_t)(e[0] | (e[1] << 8));
		pCh->characteristic.handle_value = (uint16_t)(e[3] | (e[4] << 8));

		pCh->cccd_handle       = BT_ATT_HANDLE_INVALID;
		pCh->ext_prop_handle   = BT_ATT_HANDLE_INVALID;
		pCh->user_desc_handle  = BT_ATT_HANDLE_INVALID;
		pCh->report_ref_handle = BT_ATT_HANDLE_INVALID;

		pSrvc->char_count++;
	}
}

// Parse one ACI_ATT_FIND_INFO_RESP (descriptor discovery). Format 0x01 is
// Handle(2) UUID16(2) pairs (4 bytes); 0x02 is Handle(2) UUID128(16) (18 bytes).
// Records the CCCD and the other standard descriptor handles on the current
// characteristic.
static void WbaDiscDesc(const aci_att_find_info_resp_event_rp0 *p)
{
	BtDevice_t *pDev = BtPeerFindByHdl(p->Connection_Handle);
	if (pDev == nullptr || pDev->Discovery.SrvIdx >= pDev->NbSrvc)
	{
		return;
	}
	BtGattDBSrvc_t *pSrvc = &pDev->Services[pDev->Discovery.SrvIdx];
	if (pDev->Discovery.CharIdx >= pSrvc->char_count)
	{
		return;
	}
	BtGattDBChar_t *pCh = &pSrvc->characteristics[pDev->Discovery.CharIdx];

	uint8_t pairLen = (p->Format == 0x02) ? 18 : 4;
	uint8_t total   = p->Event_Data_Length;

	for (uint8_t off = 0; (uint16_t)(off + pairLen) <= total; off += pairLen)
	{
		const uint8_t *e = &p->Handle_UUID_Pair[off];
		uint16_t hdl  = (uint16_t)(e[0] | (e[1] << 8));
		uint16_t uuid = WbaUuid16(&e[2], (uint8_t)(pairLen - 2));

		switch (uuid)
		{
			case BT_UUID_DESCRIPTOR_CLIENT_CHARACTERISTIC_CONFIGURATION:
				pCh->cccd_handle = hdl;
				break;
			case BT_UUID_DESCRIPTOR_CHARACTERISTIC_EXTENDED_PROPERTIES:
				pCh->ext_prop_handle = hdl;
				break;
			case BT_UUID_DESCRIPTOR_CHARACTERISTIC_USER_DESCRIPTION:
				pCh->user_desc_handle = hdl;
				break;
			case BT_UUID_DESCRIPTOR_REPORT_REFERENCE:
				pCh->report_ref_handle = hdl;
				break;
			default:
				break;
		}
	}
}

