IOsonata/IOsonata/ARM/ST/STM32WBAxx/src/bt_app_stm32wba.cpp
// Issue characteristic discovery for the current service, skipping empty
// services. When every service has been covered, move on to descriptors.
static void BtAppDiscStartChar(BtDevice_t *pDev)
{
	while (pDev->Discovery.SrvIdx < pDev->NbSrvc)
	{
		BtGattDBSrvc_t *pSrvc = &pDev->Services[pDev->Discovery.SrvIdx];
		uint16_t start = (uint16_t)(pSrvc->handle_range.StartHdl + 1); // skip decl
		uint16_t end   = pSrvc->handle_range.EndHdl;

		if (start <= end)
		{
			pDev->Discovery.Phase = DISC_CHARS;
			if (aci_gatt_disc_all_char_of_service(pDev->Conn.Hdl, start, end) ==
				BLE_STATUS_SUCCESS)
			{
				return;
			}
		}
		pDev->Discovery.SrvIdx++;
	}

	pDev->Discovery.SrvIdx  = 0;
	pDev->Discovery.CharIdx = 0;
	BtAppDiscStartDesc(pDev);
}

// Issue descriptor discovery for the current characteristic, skipping ones with
// no descriptor range. When every characteristic has been covered, discovery is
// complete.
static void BtAppDiscStartDesc(BtDevice_t *pDev)
{
	while (pDev->Discovery.SrvIdx < pDev->NbSrvc)
	{
		BtGattDBSrvc_t *pSrvc = &pDev->Services[pDev->Discovery.SrvIdx];

		while (pDev->Discovery.CharIdx < pSrvc->char_count)
		{
			BtGattDBChar_t *pCh    = &pSrvc->characteristics[pDev->Discovery.CharIdx];
			uint16_t        valHdl = pCh->characteristic.handle_value;
			uint16_t        start  = (uint16_t)(valHdl + 1);
			uint16_t        end;

			if ((uint8_t)(pDev->Discovery.CharIdx + 1) < pSrvc->char_count)
			{
				end = (uint16_t)(pSrvc->characteristics[pDev->Discovery.CharIdx + 1]
									 .characteristic.handle_decl - 1);
			}
			else
			{
				end = pSrvc->handle_range.EndHdl;
			}

			if (valHdl != BT_ATT_HANDLE_INVALID && start <= end)
			{
				pDev->Discovery.Phase = DISC_DESCS;
				// ST takes the characteristic value handle and walks the Find
				// Information range internally up to End_Handle.
				if (aci_gatt_disc_all_char_desc(pDev->Conn.Hdl, valHdl, end) ==
					BLE_STATUS_SUCCESS)
				{
					return;
				}
			}
			pDev->Discovery.CharIdx++;
		}
		pDev->Discovery.SrvIdx++;
		pDev->Discovery.CharIdx = 0;
	}

	pDev->Discovery.Phase = DISC_IDLE;
	BtDeviceDiscovered(pDev);
}

// ACI_GATT_PROC_COMPLETE advances the discovery state machine to the next phase
// or the next entry in the current phase.
static void WbaDiscProcComplete(const aci_gatt_proc_complete_event_rp0 *p)
{
	BtDevice_t *pDev = BtPeerFindByHdl(p->Connection_Handle);
	if (pDev == nullptr)
	{
		return;
	}

	switch (pDev->Discovery.Phase)
	{
		case DISC_SERVICES:
			pDev->Discovery.SrvIdx = 0;
			BtAppDiscStartChar(pDev);
			break;

		case DISC_CHARS:
			pDev->Discovery.SrvIdx++;
			BtAppDiscStartChar(pDev);
			break;

		case DISC_DESCS:
			pDev->Discovery.CharIdx++;
			BtAppDiscStartDesc(pDev);
			break;

		default:
			break;
	}
}

bool BtAppDiscoverDevice(BtDevice_t * const pDev)
{
	if (pDev == nullptr)
	{
		return false;
	}

	pDev->Discovery.SrvIdx  = 0;
	pDev->Discovery.CharIdx = 0;
	pDev->Discovery.Phase   = DISC_SERVICES;

	pDev->NbSrvc = 0;
	memset(pDev->Services, 0, sizeof(BtGattDBSrvc_t) * BT_DEV_SERVICE_MAXCNT);

	return aci_gatt_disc_all_primary_services(pDev->Conn.Hdl) == BLE_STATUS_SUCCESS;
}

bool BtAppWrite(uint16_t ConnHandle, uint16_t CharHandle,
                uint8_t *pData, uint16_t DataLen)
{
	if (ConnHandle == BT_CONN_HDL_INVALID || pData == NULL)
	{
		return false;
	}

	uint8_t ret = aci_gatt_write_without_resp(ConnHandle, CharHandle,
	                                          (uint8_t)DataLen, pData);
	return ret == BLE_STATUS_SUCCESS;
}

bool BtAppEnableNotify(uint16_t ConnHandle, uint16_t CccdHandle)
{
	if (ConnHandle == BT_CONN_HDL_INVALID)
	{
		return false;
	}

	// Write 0x0001 to the CCCD to enable notifications.
	uint8_t cccd[2] = { 0x01, 0x00 };
	uint8_t ret = aci_gatt_write_without_resp(ConnHandle, CccdHandle,
	                                          sizeof(cccd), cccd);
	return ret == BLE_STATUS_SUCCESS;
}
